<template>
  <v-card class="pa-4">
    <v-card-text>
      <v-flex xs12>
        <p><strong>Формат Mp4</strong>. Частота кадров - 25 в сек. Не допускается использование белого фона (количество цвета в каждом канале RGB не более 240). Цифровой контент не должен содержать black fading. Без звуковой дорожки</p>
        <p><strong>Формат JPEG</strong>. При загрузке JPEG система сама сформирует Mp4 файл и присоединит его. Для правильного отображения рекламного ролика, разрешение JPEG должно соответствовать требуемому разрешению Mp4 файла (см. требования к разрешению в пикселях ниже). </p>
        <p>Соотношение сторон:&nbsp;</p>
        <ul class="mb-6">
          <li>2:1 для билбордов (3х6)&nbsp;</li>
          <li>3:1 для суперсайтов (5х15 и 4х12)</li>
          <li>3:4 для ситибордов (3.7x2.7)</li>
        </ul>
        <p>Макс.битрейт (мбит):&nbsp;</p>
        <ul class="mb-6">
          <li>10-26 для билбордов (3х6)&nbsp;</li>
          <li>12 для ситибордов (2,7х3,7)</li>
          <li>&nbsp;7 для суперсайтов (5х15; 4х12)</li>
        </ul>
        <p>Разрешение (пиксели):&nbsp;</p>
        <ul class="mb-6">
          <li>1440 х 720 для билбордов (3х6)</li>
          <li>1536 x 1152 для ситибордов (2.7х3.7)&nbsp;</li>
          <li>1248 x 416 для для суперсайтов (5х15 и 4х12)&nbsp;</li>
          <li>1728 x 576 для для суперсайтов (5х15 и 4х12)</li>
        </ul>
        <p>
          <strong>ДИСКЛЕЙМЕР</strong>
        </p>
        <p>Минимальный размер шрифта 24 пикселя для билбордов (3х6) и 16 пикселей для суперсайтов (5х15; 4х12). Размеру должны соответствовать строчные буквы, без учета выносных элементов. В случае, если дисклеймер размещается поверх других элементов дизайна, он должен быть размещен на специальной плашке, обеспечивающей контрастное отображение</p>
        <p>Продолжительность:&nbsp;</p>
        <ul class="mb-6">
          <li>5 сек. - билборды (3х6); ситиборды (3.7x2.7); суперсайты (5х15; 4х12)&nbsp;</li>
          <!-- <li>7,5 сек. - суперсайты (5х15; 4х12)&nbsp;</li> -->
        </ul>
        <h3
          shrink
          class="subtitle-1 font-weight-bold mt-8 mb-3"
        >ДОПОЛНИТЕЛЬНЫЕ ОБЩИЕ ЮРИДИЧЕСКИЕ ТРЕБОВАНИЯ</h3>
        <p>На протяжении всего ролика (в каждом кадре) должны демонстрироваться и быть выделены относительно всего текста в дисклеймере:</p>
        <p>1) Наименование финансовой организации (банки, ломбарды, наименование застройщика (по 214-ФЗ), микрофинансовые организации, потребительские кооперативы, платежные системы и т.п.)</p>
        <p>2) Наименование страховой организации</p>
        <p>3) Информация о продавце товаров дистанционным способом</p>
        <p>4) Информация о стимулирующем мероприятии</p>
        <p>5) Информация о проектной декларации (по 214-ФЗ)</p>
        <p>6) Знак информационной продукции</p>
        <p>7) Предупреждающая надпись о противопоказаниях в рекламе медицинских услуг, медицинских изделий</p>
        <p>8) Информация о том, что рекламируемый препарат является БАД, не является лекарственным препаратом.</p>
      </v-flex>
    </v-card-text>
  </v-card>
</template>

<script>
export default {
  name: "TechnicalRequirements",
  data: () => ({
    files: [
      {
        link: "/files/TT_MAER/TT_MF_Volgograd.pdf",
        name: "Тех. требования_медиафасад_Волгоград, ул. Калинина, 13"
      },
            {
        link: "/files/TT_MAER/TT_MF_Ekaterinburg.pdf",
        name: "Тех. требования_медиафасад_Екатеринбург, ул. Малышева, 36"
      },
            {
        link: "/files/TT_MAER/TT_MF_MO_Himki.pdf",
        name: "Тех. требования_медиафасад_МО_г.о. Химки, МКАД 78 км, вл. 4Б, к. Г"
      },
            {
        link: "/files/TT_MAER/TT_MF_MSK_Varshavskoe.pdf",
        name: "Тех. требования_медиафасад_Москва, Варшавское ш., 118, к.1"
      },
            {
        link: "/files/TT_MAER/TT_MF_MSK_Leninskiy.pdf",
        name: "Тех. требования_медиафасад_Москва, пр. Ленинский, 158"
      },
            {
        link: "/files/TT_MAER/TT_MF_MSK_Riviera.pdf",
        name: "Тех. требования_медиафасад_Москва, ул. Автозаводская, 18_ТРЦ Ривьера"
      },
            {
        link: "/files/TT_MAER/TT_MF_MSK_Hanoi.pdf",
        name: "Тех. требования_медиафасад_Москва, Ярославское шоссе 146, к. 2_МФК «Ханой-Москва»"
      },
            {
        link: "/files/TT_MAER/TT_MF_NN.pdf",
        name: "Тех. требования_медиафасад_Нижний Новгород, пл. Комсомольская, 2"
      },
            {
        link: "/files/TT_MAER/TT_MF_Novosib.pdf",
        name: "Тех. требования_медиафасад_Новосибирск, пл. Карла-Маркса, 1"
      },
            {
        link: "/files/TT_MAER/TT_MF_Perm.pdf",
        name: "Тех. требования_медиафасад_Пермь, ул. Революции, 13"
      },
                  {
        link: "/files/TT_MAER/TT_MF_Samara.pdf",
        name: "Тех. требования_медиафасад_Самара, ш. Московское, лит.Д, К 28Б"
      },
                  {
        link: "/files/TT_MAER/TT_MF_Tyumen.pdf",
        name: "Тех. требования_медиафасад_Тюмень, ул. Республики, 61"
      },
                  {
        link: "/files/TT_MAER/TT_MF_Ufa.pdf",
        name: "Тех. требования_медиафасад_Уфа, ул. Рихарда Зорге, 9"
      },
                  {
        link: "/files/TT_MAER/TT_MF_Chelyabinsk.pdf",
        name: "Тех. требования_медиафасад_Челябинск, пр. Свердловский, 51"
      },
    ],
  }),
};
</script>
