<template>
    <v-card class="pa-4">
        <v-card-text>
            <v-row>
                <v-col cols="12">
                    <h1 class="primary--text">
                        <b>■ Пример работы аукциона</b>
                    </h1>
                </v-col>
                <v-col cols="12" md="6" class="pl-8">
                    <v-icon color="primary" x-large>photo_library</v-icon>
                    <div class="pt-4">
                        <b>Формат JPEG.</b> При загрузке JPEG система сама
                        сформирует Mp4 файл и присоединит его. Для правильного
                        отображения рекламного ролика, разрешение JPEG должно
                        соответствовать требуемому разрешению Mp4 файла (см.
                        требования к разрешению в пикселях ниже).
                    </div>
                </v-col>
                <v-col cols="12" md="6" class="pl-8">
                    <v-icon color="primary" x-large>video_collection</v-icon>
                    <div class="pt-4">
                        <b>Формат mp4.</b> Частота кадров - 25 в сек. Не
                        допускается использование белого фона (количество цвета
                        в каждом канале RGB не более 240). Цифровой контент не
                        должен содержать black fading. Без звуковой дорожки.
                    </div>
                </v-col>
                <v-col cols="12">
                    <v-row>
                        <v-col cols="12" md="4" class="mt-8">
                            <h1 class="primary--text">
                                <b>■ Билборд</b>
                            </h1>
                            <div class="pt-4 pl-4">
                                <p class="mb-2">
                                    Соотношения сторон: <b>2:1</b>
                                </p>
                                <p class="mb-2">
                                    Разрешение (пиксели): <b>1440 х 720</b>
                                </p>
                                <p class="mb-2">
                                    Макс.битрейт (мбит): <b>10-26</b>
                                </p>
                                <p class="mb-2">
                                    Продолжительность: <b>5 сек</b>
                                </p>
                            </div>
                        </v-col>
                        <v-col cols="12" md="4" class="mt-8">
                            <h1 class="primary--text">
                                <b>■ Суперсайт</b>
                            </h1>
                            <div class="pt-4 pl-4">
                                <p class="mb-2">
                                    Соотношения сторон: <b>3:1</b>
                                </p>
                                <p class="mb-2">
                                    Разрешение (пиксели): <b>1728 x 576</b>
                                </p>
                                <p class="mb-2">
                                    Макс.битрейт (мбит): <b>7</b>
                                </p>
                                <p class="mb-2">
                                    Продолжительность: <b>5 сек</b>
                                </p>
                            </div>
                        </v-col>
                        <v-col cols="12" md="4" class="mt-8">
                            <h1 class="primary--text">
                                <b>■ Ситиборд</b>
                            </h1>
                            <div class="pt-4 pl-4">
                                <p class="mb-2">
                                    Соотношения сторон: <b>3:4</b>
                                </p>
                                <p class="mb-2">
                                    Разрешение (пиксели): <b>1536 x 1152</b>
                                </p>
                                <p class="mb-2">
                                    Макс.битрейт (мбит): <b>12</b>
                                </p>
                                <p class="mb-2">
                                    Продолжительность: <b>5 сек</b>
                                </p>
                            </div>
                        </v-col>
                    </v-row>
                </v-col>
                <v-col cols="12" class="mt-8">
                    <h1 class="primary--text">
                        <b>■ Дисклеймер</b>
                    </h1>
                    <div class="pt-4 pl-4">
                        Минимальный размер шрифта 24 пикселя для билбордов
                        <b>(3х6)</b> и 16 пикселей для суперсайтов
                        <b>(5х15; 4х12)</b>. Размеру должны соответствовать
                        строчные буквы, без учета выносных элементов. В случае,
                        если дисклеймер размещается поверх других элементов
                        дизайна, он должен быть размещен на специальной плашке,
                        обеспечивающей контрастное отображение.
                    </div>
                </v-col>
                <v-col cols="12" class="mt-8">
                    <h1 class="primary--text">
                        <b>■ Юридические требования</b>
                    </h1>
                    <div class="pt-4 pl-4">
                        <p>
                            На протяжении всего ролика (в каждом кадре) должны
                            демонстрироваться и быть выделены относительно всего
                            текста в дисклеймере:
                        </p>
                        <p>
                            1) Наименование финансовой организации (банки,
                            ломбарды, наименование застройщика (по 214-ФЗ),
                            микрофинансовые организации, потребительские
                            кооперативы, платежные системы и т.п.)
                        </p>
                        <p>2) Наименование страховой организации</p>
                        <p>
                            3) Информация о продавце товаров дистанционным
                            способом
                        </p>
                        <p>4) Информация о стимулирующем мероприятии</p>
                        <p>5) Информация о проектной декларации (по 214-ФЗ)</p>
                        <p>6) Знак информационной продукции</p>
                        <p>
                            7) Предупреждающая надпись о противопоказаниях в
                            рекламе медицинских услуг, медицинских изделий
                        </p>
                        <p>
                            8) Информация о том, что рекламируемый препарат
                            является БАД, не является лекарственным препаратом.
                        </p>
                    </div>
                </v-col>
            </v-row>
        </v-card-text>
    </v-card>
</template>

<script>
import { mapGetters } from "vuex";
export default {
    name: "TechnicalRequirements",
    data: () => ({
        files: [
            {
                link: "/files/TT_MAER/TT_MF_Volgograd.pdf",
                name: "Тех. требования_медиафасад_Волгоград, ул. Калинина, 13",
            },
            {
                link: "/files/TT_MAER/TT_MF_Ekaterinburg.pdf",
                name: "Тех. требования_медиафасад_Екатеринбург, ул. Малышева, 36",
            },
            {
                link: "/files/TT_MAER/TT_MF_MO_Himki.pdf",
                name: "Тех. требования_медиафасад_МО_г.о. Химки, МКАД 78 км, вл. 4Б, к. Г",
            },
            {
                link: "/files/TT_MAER/TT_MF_MSK_Varshavskoe.pdf",
                name: "Тех. требования_медиафасад_Москва, Варшавское ш., 118, к.1",
            },
            {
                link: "/files/TT_MAER/TT_MF_MSK_Leninskiy.pdf",
                name: "Тех. требования_медиафасад_Москва, пр. Ленинский, 158",
            },
            {
                link: "/files/TT_MAER/TT_MF_MSK_Riviera.pdf",
                name: "Тех. требования_медиафасад_Москва, ул. Автозаводская, 18_ТРЦ Ривьера",
            },
            {
                link: "/files/TT_MAER/TT_MF_MSK_Hanoi.pdf",
                name: "Тех. требования_медиафасад_Москва, Ярославское шоссе 146, к. 2_МФК «Ханой-Москва»",
            },
            {
                link: "/files/TT_MAER/TT_MF_NN.pdf",
                name: "Тех. требования_медиафасад_Нижний Новгород, пл. Комсомольская, 2",
            },
            {
                link: "/files/TT_MAER/TT_MF_Novosib.pdf",
                name: "Тех. требования_медиафасад_Новосибирск, пл. Карла-Маркса, 1",
            },
            {
                link: "/files/TT_MAER/TT_MF_Perm.pdf",
                name: "Тех. требования_медиафасад_Пермь, ул. Революции, 13",
            },
            {
                link: "/files/TT_MAER/TT_MF_Samara.pdf",
                name: "Тех. требования_медиафасад_Самара, ш. Московское, лит.Д, К 28Б",
            },
            {
                link: "/files/TT_MAER/TT_MF_Tyumen.pdf",
                name: "Тех. требования_медиафасад_Тюмень, ул. Республики, 61",
            },
            {
                link: "/files/TT_MAER/TT_MF_Ufa.pdf",
                name: "Тех. требования_медиафасад_Уфа, ул. Рихарда Зорге, 9",
            },
            {
                link: "/files/TT_MAER/TT_MF_Chelyabinsk.pdf",
                name: "Тех. требования_медиафасад_Челябинск, пр. Свердловский, 51",
            },
        ],
    }),
    computed: {
        ...mapGetters({
            isGalmed: "auth/getIsGalmed",
            isMaer: "auth/getIsMaer",
        }),
    },
};
</script>
